* Wrap region
#+BEGIN_SRC emacs-lisp

#+END_SRC

#+RESULTS:
: t

* Syntax behaviour
#+BEGIN_SRC emacs-lisp
(modify-syntax-entry ?' "'")
(modify-syntax-entry ?^ "('")
(modify-syntax-entry ?$ ")'")
  ;; (modify-syntax-entry ?' "'")
  ;;  (modify-syntax-entry ?' "^'")
#+END_SRC

#+RESULTS:

#+RESULTS'

' fdsfa'

* shell behaviour

** npm does not display prompt
#+BEGIN_SRC emacs-lisp
  (add-hook 'commint-mode-hook
            (lambda () (setenv "PAGER" "cat")))
    (add-to-list
             'comint-preoutput-filter-functions
             (lambda (output)
               (replace-regexp-in-string "\\[[0-9]+[GK]" "" output)))
#+END_SRC

#+RESULTS:
| lambda | (output) | (replace-regexp-in-string \[[0-9]+[GK]  output) |

* No warnings
#+BEGIN_SRC emacs-lisp
(setq warning-minimum-level :emergency)
#+END_SRC

#+RESULTS:
: :emergency
